[
    {
        "Parameter": "Minimizing Distractions",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the degree of visual distraction caused by secondary elements present in the image. It assesses the extent to which these elements disrupt the clear perception of the main subject by analyzing visual density, clarity of hierarchy, and the risk of perceptual competition. This assessment does not address the overall aesthetics of the scene but only the impact of these elements on the readability of the subject.\n\nScoring examples:\n– 0: The image is very clean; the subject is isolated, with no competing elements visible around it.\n– 50: The image contains a few perceptible secondary elements, but their presence does not hinder the reading of the main subject.\n– 100: The image is visually cluttered; many elements compete with the subject, making its perception difficult or ambiguous."
    },
    {
        "Parameter": "Subtle Complexity",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter identifies the presence of discreet visual or narrative details, often barely visible at first glance, but which contribute to enriching the reading of the image once discovered. This could be a character in the background, a secondary gesture, a reflection, or a visual clue that becomes more important later. This criterion does not concern overall visual density, but rather an image's ability to reveal significant elements in a delayed manner.\n\nCase examples:\n– True: A secondary silhouette in a mirror, a discreet symbol integrated into the background, a narrative detail revealed after careful observation.\n– False: An immediately readable image where all elements are apparent and without surprises, or details that, although numerous, add nothing to the understanding or narrative of the image."
    },
    {
        "Parameter": "Composition Contrast",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures how effectively the image uses differences in color, light, or texture to emphasize the main subject. High compositional contrast creates a clear visual separation between the subject and its surroundings, while low contrast conveys a smoother continuity or blending between elements. This is not a judgment of image quality, but rather an assessment of how well these contrasts contribute to the visual organization and hierarchy of the scene.\n\nScoring examples:\n– 0: The subject blends into the background, with little difference in light, color, or texture.\n– 50: The contrast is moderate: the subject stands out but remains integrated into the overall scene.\n– 100: The subject is strongly emphasized by a marked contrast in light, tone, or texture relative to its surroundings."
    },
    {
        "Parameter": "Depth of Field",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the extent of the sharpness in the image, in order to assess the depth of field used. A shallow depth of field corresponds to a very restricted sharp area (usually around the main subject), with a blurred background; a deep depth of field corresponds to sharpness spread across the entire scene. This measurement does not judge the intention or style, but rather the way sharpness is distributed between the image planes.\n\nScoring examples:\n– 0: The entire scene is sharp, from foreground to background (landscape, architectural photography, etc.).\n– 50: The subject is sharp and the background begins to blur slightly, but is not completely erased.\n– 100: The subject is isolated against a completely blurred background, with no sharp details in the surroundings."
    },
    {
        "Parameter": "Negative Space",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter identifies the deliberate use of empty or sparsely populated areas around the main subject to enhance its visibility, create visual tension, or structure the composition. Negative space is perceived as an active element in the image, highlighting the subject through contrast or isolation, without containing secondary narrative or visual information. This criterion is not limited to the presence of empty space, but to its intentional use as a graphic or narrative counterpoint.\n\nExamples:\n– True: A subject positioned against a vast, solid background, a silhouette cut out of an empty sky, or an isolated figure amidst a minimal setting.\n– False: An image with few elements but where the empty space does not structure the composition; or an empty background but without a strong perceptual connection to the subject."
    },
    {
        "Parameter": "Texture",
        "Evaluation": "Score",
        "New Prompt": "# 🧠 Prompt AI — Visual Texture Assessment (v2.5)\n\n## 🎭 ROLE\n\nYou are an **image critic specializing in texture analysis**.\nYour mission: to evaluate **the extent to which textures actively contribute to the composition, depth, and narrative** of a photograph.\n\n---\n\n## 🎯 OBJECTIVE\n\nEvaluate the **function** of textures in the image, not just their presence.\nFocus on their ability to be:\n\n* **Central and visually dominant**\n* **Legible** (sharp, detailed, contrasty)\n* **Compositionally active** (eye guidance, hierarchy, rhythm)\n* **Relevant to narrative or atmosphere**\n\nTextures should be **structural, not decorative**. They should reinforce the **visual tension**, **depth**, or **narrative intent** of the image.\n\n---\n\n## 📉 TO BE PENALIZED\n\n* Textures **in the background**, **blurred**, or **without visual function**\n* **Graphic or repetitive patterns** mistaken for texture (circles, lines, squares)\n* Surface details **that do not influence the reading of the image**\n* **Textures that are clearly visible but have no impact on the narrative or perception**\n* **Presence of material not visually exploited** (e.g., smooth leather, polished metal, clean parquet flooring)\n* **Reflections or lighting** must **never be confused with a supporting textural material**, even if they are supported by a visible surface (e.g., puddles, shop windows, urban neon signs)\n* **Ornaments, sculpted motifs, or narrative details** (architecture, frescoes, costumes) **must not be overvalued** if the material itself **is not central to the reading**.\n\n> ⚠️ A **repeated shape**, a **well-rendered surface**, or a **readable detail** are not enough.\n> Texture must transform the perception, organization, or atmosphere** of the image. If the image would function **exactly the same without the texture**, it is **irrelevant**.\n\n---\n\n## 🌀 SPECIAL CASES\n\n### Texture occupying the entire image\n\nAward a **high score (80–100)** only if:\n\n* The material is **visually palpable** (cracking, grain, roughness, etc.)\n* It **structures the reading** or generates **tension, immersion, or depth**\n\n> ⚠️ A **repeating pattern covering the entire image** is **not enough** without a **strong and meaningful material**.\n\n### Graphic or architectural image\n\nDo not award a high score if:\n\n* The surfaces are smooth, clean, and regular, even when well lit.\n* The image is based on shapes or structures, without any perceptible material.\n\nAsk yourself:\nWould the image be the same if the surface details were blurred?\n\nIf yes, texture is not an active factor.\n\n### Texture trap (trap)\n\nSome textures appear present but do not provide any transformation in interpretation:\n\n* Banana peel, clean parquet floor, leather, standard clothing, polished metal.\n\nEven if they are clearly visible, these textures should not be rated unless they convey a clear visual intention (tension, symbolism, atmosphere).\n\n### Urban or Cinematic Atmospheres\n\nEven if an image has textures (walls, floors, puddles), **they should only be emphasized if they directly contribute to the reading or immersion**.\n\n> Be careful with street, nighttime, or cinematic images: if the visual impact relies on lights, lines, or reflections, the texture may appear present without being active. **Systematically test blurred reading** to validate its relevance.\n\n### Sculptures, frescoes, complex details\n\n> Do not confuse **sculpted or decorative narrative details** with **surface texture**.\n> A visually rich image may have **very little texture** if its material **does not enhance the reading** or can be **replaced by a flat pattern**.\n\n---\n\n## 🔍 TIP — Blurry Reading\n\nImagine the blurred image:\nIf the **material still structures perception**, **guides the gaze**, or **creates volume**, the texture is relevant.\n\nBut if **the visual message remains unchanged**, or if the material becomes invisible without altering the reading, the texture is **decorative**.\n\n---\n\n## ✅ RATING\n\n| Scale | Description |\n| ---------- | ------------------------------------------------------------------------ |\n| **0–20** | Non-existent, decorative, or perceptually insignificant texture |\n| **30–60** | Visible but secondary or partially useful texture |\n| **70–100** | Central, legible, and structuring texture in reading or atmosphere |\n\n---\n\n## 🧾 CANONICAL EXAMPLES\n\n### 🔸 Score 10:\n\nA clean white wall, a crisp floor with no visible irregularities, polished metal — **no tension or exploited material**.\n\n### 🔸 Score 30:\n\nA damp urban alley, with degraded flooring and textured walls, but whose graphic impact still relies on the lighting and perspective, even when blurred.\n\n### 🔸 Score 40:\n\nA highly sculpted Gothic portal, but whose interpretation relies on the figurative details and not the material.\n\n### 🔸 Score 50:\n\nA sweater, visible and clear but secondary in the image, a slightly grained surface with no narrative effect.\n\n### 🔸 Score 70:\n\nA wrinkled hand resting on a rough wooden table, where the material **carries the narrative or emotion**.\n\n### 🔸 Score 90+:\n\nImmersive close-up of a cracked wall, an organic surface that **structures the image** and **absorbs the gaze** through its material alone."
    },
    {
        "Parameter": "Aspect Ratio",
        "Evaluation": "Radio",
        "New Prompt": "This parameter identifies the dominant visual format of the image, based on the ratio between the height and width of the frame. An image can be square (1:1 ratio), horizontal (wider than it is tall), or vertical (taller than it is wide). This choice influences the perception of the image, the flow of the eye, and sometimes the relationship between the subject and its environment. The goal is not to judge the format used, but to recognize it for what it expresses in terms of visual construction.\n\nPossible options:\n– Square: The frame is as tall as it is wide, often used for symmetrical, centered, or graphic compositions.\n– Horizontal: The frame is wider than it is tall; favors a panoramic or expansive reading of the scene.\n– Vertical: The frame is taller than it is wide; often used for portraits or to accentuate upward dynamics."
    },
    {
        "Parameter": "Implied Lines",
        "Evaluation": "Score",
        "New Prompt": "# 🧠 Optimized Prompt – Implicit Line Detection and Evaluation\n\n## 🎭 Role\n\nYou are a **photo critic expert in visual composition**, specializing in the identification of **implicit lines**: those invisible but perceptible alignments that guide the eye and structure the reading of an image.\n\n---\n\n## 🎯 Objective\n\nIdentify, describe, and evaluate the quality of **implicit lines** present in photography, that is,:\n\n* The **undrawn visual connections** between image elements.\n* The **felt** paths that **guide the eye** or **structure the composition**.\n* The **graphic or directional** lines that are not based on visible physical features.\n\n---\n\n## ⚠️ Clear Definition\n\nAn **implicit line** is an **invisible perceptual connection** formed by:\n\n* A subject's **gaze**, **gesture**, or **posture**.\n* The **alignment** or **repetition** of **visually separate** objects.\n* The **spatial symmetry** between several elements.\n* The **rhythm** between distinct shapes, **color zones**, or **light values**.\n* The **frozen** or **anticipated** movement (jump, flight, run-up, etc.).\n\n> It must **connect at least two distinct visual points**, create a **perceptual flow**, and **actively participate in the composition**.\n> It is **not drawn or materialized** (no wire, bar, edge, or linear physical object).\n\n---\n\n## ❌ What is not an implied line\n\nSystematically reject:\n\n* **Visible lines**: wires, walls, edges, bars, structures, architecture.\n* **Internal patterns** within an object (stripes, grooves, wood grain, branches, repetitive facades).\n* The **symmetry or axis of a single object**.\n* **Isolated glances** without a target point.\n* Repetitions without a perceptual connection (e.g., scattered birds without rhythm or direction).\n* Any structure **that plays no active role in the reading or narration**.\n\n---\n\n## 📏 Evaluation criteria\n\nAsk yourself these 3 questions:\n\n1. Are one or more **coherent implied lines** perceptually visible?\n2. Do these lines actually **guide the gaze**? 3. Do they contribute to a **clear, balanced, and meaningful composition**?\n\n---\n\n## 🧮 Rating\n\n**0** = No perceptible implied line.\n**30–50** = Weak or partial implied line, lacking structure.\n**60–75** = Visible and clear implied line(s), contributing to reading.\n**80–100** = Strong implied line(s), central to the composition, well-integrated, fluid, coherent, and graphic.\n\n---\n\n## ✅ Response Format\n\nSubmit your evaluation **in JSON**, in this format:\n\n```json\n{\n\"score\": [number between 0 and 100],\n\"comment\": \"[Clear, concise, and well-argued analysis of the implicit lines detected]\"\n}\n```\n\n---\n\n## 📷 Corrected Examples\n\n❌ Bad Case — Score: 0/100\nA bird perched on a wire.\n➤ The wire is a visible line. No other element creates an implicit connection.\n\n❌ Overinterpreted Case — Score: 0/100\nAn undulating facade with rhythmic balconies.\n➤ These are internal patterns, with no connection between distinct elements.\n\n✅ Strong Case — Score: 90/100\nTwo people looking at a common point, directed posture, objects aligned diagonally.\n➤ Obvious, directional, fluid implicit line, central to the composition."
    },
    {
        "Parameter": "Scale and Proportion",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the extent to which the image uses size relationships between elements to structure the scene, suggest perspective, or produce an effect of emphasis or disproportion. Scale can emphasize the relative importance of a subject, create tension between proximity and distance, or provoke emotion by altering our visual cues. The score does not reflect the natural presence of objects of different sizes, but their intentional use in the composition.\n\nScoring Examples:\n– 0: Element sizes are consistent and have no particular role in visual or narrative construction.\n– 50: A size difference is noticeable between nearby subjects, inducing a visual hierarchy, but is not exaggerated.\n– 100: The image clearly relies on an unusual or exaggerated scale: a striking contrast in size, the effect of forced perspective, or disproportion used to dramatize or symbolize."
    },
    {
        "Parameter": "Color Harmony",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the visual coherence and chromatic compatibility between the colors present in the image. Harmony can arise from complementarity (opposite colors on the color wheel), analogy (neighboring colors), or a subtle balance between hues, tones, and saturations. A high score corresponds to a palette perceived as fluid, coherent, or aesthetically controlled; a low score reflects visual dissonance, a lack of color structure, or a perceptual incompatibility between colors.\n\nScoring examples:\n– 0: Colors are mismatched, garish, or disjointed, with no apparent visual logic.\n– 50: Some colors work well together, but the palette remains partially unbalanced or unfinished.\n– 100: All colors are harmoniously distributed, with a coherent and visually pleasing palette based on a clear chromatic relationship."
    },
    {
        "Parameter": "Location Setting",
        "Evaluation": "Radio",
        "New Prompt": "This parameter identifies whether the photographed scene is located in an indoor, outdoor, or undetermined space. An indoor location refers to an enclosed or covered space (room, building, architectural structure). An outdoor location refers to an open environment (natural, urban, public). The Not Applicable category is used when the image contains no clear spatial cues to determine its context (plain background, abstraction, generated or composite image).\n\nPossible options:\n– Indoor: The scene is clearly captured in an enclosed space (room, hall, tunnel, etc.).\n– Outdoor: The image shows an open or exposed space (street, forest, square, etc.).\n– Not Applicable: There are no elements that allow a conclusion to be drawn (neutral background, isolated studio, virtual or abstract space)."
    },
    {
        "Parameter": "Rule of thirds",
        "Evaluation": "Boolean",
        "New Prompt0": "You are an experienced photography teacher reviewing a student's image. The photo is already displayed with a 3x3 rule of thirds grid overlay.\n\nYour task:\n1. Identify the subject: In a single short sentence, state what you consider the main subject or dominant visual element (e.g., \"a French bulldog in a hoodie,\" \"a red kayak on turquoise water,\" \"the city skyline\").\n\n2. Recall the rule: The rule of thirds places important subjects or horizon lines along vertical or horizontal grid lines or at one of the four intersections. Proper use generally means that the subject's center of interest is approximately one-ninth of the frame (≈ ±10% of the width/height) around a grid line or intersection.\n\n3. Room for Interpretation: A Slight Misalignment or Intentional Creativity. A misalignment can still be considered if the image appears clearly balanced according to the rule of thirds. However, a subject placed in the center, flush with an edge, or without discernible alignment should be considered a misstep.\n\n4. Decide – After weighing the pros and cons of artistic intent, display only:\n\nTrue: if the placement credibly adheres to the rule (including acceptable tolerance and artistic leeway); or\nFalse: if it does not.\n\nAdditional Details:\n- To assist you with this task, the two horizontal and two vertical lines dividing the image into thirds are drawn on the photo. - Scoring type: Boolean (Consider \"true\" only if the primary subject lies primarily and clearly on a grid line or intersection; exceptionally, \"true\" may be assigned if the subject is very close to an intersection or line, is the clear focal point in an empty or minimal frame, and demonstrates clear compositional intent).\n- Definition of primary subject: The largest and most visible object or person in the frame.\n- Clarify scope: Assess only the primary subject and mention secondary elements only if they also clearly align with a grid line or intersection.\n- Positional language: Explicitly state which intersection(s) or grid line(s) the subject aligns with (e.g., \"top right intersection,\" \"left vertical line\").\n- Near-miss management: If the subject is close but not clearly on an intersection or line, specify the distance, explain the visual impact, and indicate whether contextual factors (focus, emptiness, intention) justify a \"true\" despite a slight offset.\n- Visual annotation reference: Explicitly reference the visual grid of thirds provided when describing the alignment or misalignment.\n- Provide a very concise (no more than a few sentences) but detailed explanation of how the elements are (non)compliant with this rule, with precise positional references, a justification based on visual context if relevant, and a strict but thoughtful standard for what is considered compliant.",
        "New Prompt": "You are a seasoned photography instructor reviewing a student's image. The photo is already displayed with a 3 × 3 'rule-of-thirds' grid overlay.\n\nYour task:\n1. Spot the subject – In one short clause, state what you judge to be the main subject or dominant visual element (e.g., 'a French bulldog in a hoodie,' 'a red kayak on turquoise water,' 'the urban skyline').\n\n2. Recall the rule – The rule of thirds places important subjects or horizon lines along the grid's vertical or horizontal lines or at one of the four intersections. Good use usually means the subject's center of interest falls within roughly one-ninth of the frame (≈ ±10% of width/height) around a grid line or intersection.\n\n3. Room for interpretation – A slight offset or intentional creative deviation can still count if the image clearly feels balanced in a rule-of-thirds sense. However, a subject sitting dead-center, flush against an edge, or with no discernible alignment should be marked as a miss.\n\n4. Analyze and Decide – After weighing accuracy and artistic intent, internally decide on a boolean score:\n\ntrue: if the placement credibly follows the rule (including acceptable tolerance and artistic leeway); or\n\nfalse: if it does not.\n\n5. Formulate Explanation – Create a very concise (no more than a few sentences) but detailed explanation of how the elements (do not) conform to this rule, with precise positional references, justification based on visual context if relevant, and a strict-but-thoughtful standard for what qualifies as conforming.\n\n\nAdditional details:\n\n- To help you with the task, the two horizontal and two vertical lines dividing the image into thirds are drawn on the photo.\n\n- Score type: The `score` value in the JSON must be a Boolean (`true` or `false`).\n\n- Main subject definition: The largest, most visually prominent object or person in the frame.\n\n- Clarify scope: Assess only the main subject, and mention secondary elements in the `explanation` only if they are also clearly aligned to a grid line or intersection.\n\n- Positional language: In your `explanation`, explicitly state which grid intersection(s) or line(s) the subject aligns with (e.g., 'top-right intersection', 'left vertical line').\n\n- Near-misses handling: If the subject is close but not clearly on an intersection or line, specify this in the `explanation`, explain the visual impact, and indicate if contextual factors (focus, emptiness, intent) justify a `true` score despite the minor offset.\n\n- Visual annotation reference: In your `explanation`, reference the provided visual thirds-grid explicitly when describing alignment or misalignment."
    },
    {
        "Parameter": "Haze Impact",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the likelihood that an atmospheric haze effect is present in the image, evaluating visual cues such as reduced contrast, softening of distant shapes, and general light diffusion. Perceptible haze manifests as a loss of sharpness in background planes, diffuse light veiling, and a softening of colors or edges. The score reflects the degree of visual certainty that this effect is indeed due to haze, and not optical blur or digital processing.\n\nScoring examples:\n– 0: The image is sharp and contrasty in all planes, with no signs of haze or light diffusion.\n– 50: Haze is perceptible at a distance, but the image retains good legibility; the effect is likely but moderate.\n– 100: Haze is clearly identifiable, impacts perceptual depth of field, and creates a generalized diffuse effect."
    },
    {
        "Parameter": "Dust Existence",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter detects the visible presence of dust, dirt, or smudges on the lens or sensor, manifesting as blurred, dark, or streaked areas in the image. These marks generally appear in bright or uniform areas and are not related to objects in the scene. They can locally distort light or impair sharpness. This criterion should only be validated if the image shows clear signs of optical contamination, not simply normal variations in the setting.\n\nExamples:\n– True: One or more dark spots are visible in fixed locations, with a blurring or distortion effect incompatible with the photographed scene.\n– False: No fixed or inconsistent marks are visible; sharpness and clarity are consistent across the entire image."
    },
    {
        "Parameter": "Fringe",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter detects the presence of chromatic aberration in the image, generally visible as fine colored fringes (purple, green, magenta, etc.) located along high-contrast edges. This optical phenomenon results from the difficulty some lenses have in focusing all wavelengths of light at the same point. Only fringes visible in sharp transition areas between light and dark should be considered, not artistic effects or natural reflections.\n\nCase examples:\n– True: Artificial colored fringes appear around the edges of a building against a sky background, or on the sharp contours of a brightly lit subject.\n– False: The contours are sharp and natural, with no unwanted coloration; the color variations are an integral part of the scene or lighting."
    },
    {
        "Parameter": "Starburst",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter identifies the presence of a starburst effect, visible as sharp, linear rays of light emanating from a point light source (e.g., sun, lamp, spotlight). This symmetrical pattern is caused by the diffraction of light through the diaphragm blades, often magnified at small apertures. It should be clearly distinguishable from diffuse halos or optical flares, and only applies to images where these rays form a discernible starburst pattern.\n\nCase examples:\n– True: A streetlight at night generates regular, star-shaped rays of light; filtered sunlight produces a well-defined geometric flare.\n– False: The light is diffuse, with no structured radiation; the image contains a flare, halo, or overexposure without a starburst structure."
    },
    {
        "Parameter": "Moire",
        "Evaluation": "Boolean",
        "New Prompt": "This setting detects the presence of a moiré pattern in the image, an optical artifact generated by interference between fine, repetitive textures (fabrics, stripes, mesh, screens, etc.) and the digital sensor's grid. Moire patterns manifest as wavy distortions, raster effects, rainbow-like colored artifacts, or an abnormal shimmering texture. These anomalies often appear in areas of high spatial frequency, even if subtle or localized.\n\nExamples:\n– True: A finely patterned fabric produces colored waves; a screen displays an unstable or shimmering grid; a repetitive texture creates unnatural visual waves.\n– False: Patterns remain clear and regular without distortion; no color shift or artificial shimmer is visible in fine areas."
    },
    {
        "Parameter": "ColorMode",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter identifies whether the image is black and white or color. An image is considered black and white only if no color information is present: all pixels must be pure grayscale, with no color tint. Desaturated styles, colored monochrome filters (e.g., sepia, cyanotype), or limited palettes remain color images, even if they visually appear to have little color.\n\nExamples:\n– True: The image contains only shades of gray, with no trace of color or color tone.\n– False: The image contains one or more hues, even subtle ones (soft yellow, pastel blue, vintage filter), or has partial desaturation."
    },
    {
        "Parameter": "Luminosity",
        "Evaluation": "Score",
        "New Prompt": "# 🧠 Prompt AI — Brightness Assessment (enhanced v1.2)\n\n## 🎭 ROLE\n\nYou are an intelligence specialized in photographic analysis. Your task is to evaluate the **general brightness** of an image. This does not concern technical exposure or the directional quality of the light, but only the **overall luminous impression**.\n\n---\n\n## 🧪 3-STEP METHOD\n\n1. **Blurred Reading (optional but recommended)**: Start by analyzing a heavily blurred version of the image to neutralize details and estimate the perceptual average illumination.\n2. **Observation of Dominant Areas**: Identify the relative proportion of light and dark areas in the image.\n3. **Brightness Scale Rating**: Assign a score between 0 and 100 based on the overall visual balance.\n\n---\n\n## 📊 RATING GUIDELINE\n\n| Overall illumination | Light dominance | Extensive dark areas | Indicative score |\n| ---------------- | ---------------- | ---------------------- | --------------- |\n| Very strong | Yes | No | 85–100 |\n| Moderately bright | Yes | Slight | 65–80 |\n| Balanced | Balanced | Balanced | 45–60 |\n| Weak | Slight | Dominant | 20–40 |\n| Very dark | No | Yes | 0–20 |\n\n---\n\n## 🌐 EXTREME BLUR READING (optional but recommended)\n\nThis method allows you to:\n\n* neutralize the influence of local details and fine contrasts,\n* restore a **perceptual average of the overall illumination**,\n* mimic the way a photographer estimates the clarity of an image at first glance.\n\n👉 Recommended **especially in cases with high dynamic range** (e.g., nighttime urban scenes, dark stairways with occasional lighting).\n\n---\n\n## 🎯 SETTING PURPOSE: Brightness (Setting 40)\n\n**Brightness** corresponds to the perceived light intensity on a global scale. An image can be:\n\n* dark (low key),\n* balanced,\n* bright (high key).\n\n⚠️ This criterion does not assess **technical exposure** (clogged or burned-out areas), **light direction**, or **contrast**. It only assesses **the overall impression of illumination**.\n\n---\n\n## 🔢 RATING SCALE\n\n* `0–15`: Near total darkness (night scene with no light source)\n* `20–35`: Controlled dark atmosphere (low key)\n* `40–55`: Natural lighting, visual balance\n* `60–75`: Bright image, perception of openness or clarity\n* `80–100`: High key or extremely bright atmosphere\n\n📌 A very dark image can receive a low rating without compromising its quality — **the rating does not assess artistic intent or achievement.**\n\n---\n\n## ❌ MISTAKES TO AVOID\n\n* Do not confuse **overall brightness** with **exposure quality**.\n* Do not be misled by locally bright areas or bright colors.\n* Do not overestimate light based on isolated or point highlights.\n\n---\n\n## 🧠 EXPECTED OUTPUT (JSON)\n\n```json\n{\n\"parameter\": \"Brightness\",\n\"rating\": 50,\n\"explanation\": \"The image has soft, even lighting. There are no very dark areas or overexposure. The overall lighting impression is balanced.\"\n}\n```\n\n---\n\n## 🧪 EXAMPLES (A to L)\n\n**Image A:** Clearly legible chiaroscuro portrait ➜ `Brightness = 30`\n\n**Image B:** Very bright scene with a clear sky and white elements, in a high key style ➜ `Brightness = 80`\n\n**Image C:** Balanced photo, evenly diffused light ➜ `Brightness = 50`\n\n**Image D:** White snake on a bright background, natural light ➜ `Brightness = 90`\n\n**Image E:** Brightly lit textured white wall ➜ `Brightness = 95`\n\n**Image F:** Metal keys on a very dark interior background ➜ `Brightness = 20`\n\n**Image G:** Chiaroscuro portrait with a black background ➜ `Brightness = 30`\n\n**Image H:** Book in soft light on stone ➜ `Brightness = 55`\n\n**Image I:** Dark stairs with light above ➜ `Brightness = 40`\n\n**Image J:** Night skyline, point light on buildings ➜ `Brightness = 45`\n\n➡️ These examples cover a full range of situations, from extreme low key to diffuse high key, and include cases with high dynamic range. (D to L) will enrich this section based on the tests carried out.\n\n---\n\n## 📚 TYPICAL GUIDELINES ACCORDING TO VISUAL STYLES\n\n| Photographic Intent | Expected Brightness | Exposure (out of scope) |\n| --------------------------- | ------------------- | ----------------------- |\n| Low key (dark intent) | 15–35 | Can be well exposed |\n| Balanced / neutral | 40–60 | Standard Reading |\n| High Key (Clear Intent) | 70–95 | May Be Well Exposed |\n\n> 💡 **Note**: These guidelines are used to situate **brightness** within a visual intent. They do not indicate whether the image is well or poorly exposed."
    },
    {
        "Parameter": "Saturation",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the image's saturation level, that is, the intensity or purity of the perceived colors. High saturation results in rich, vivid, and dense hues; low saturation produces more muted, muted, or grayish tones. This criterion does not take into account clarity or brightness: a color can be dark but highly saturated (deep red, midnight blue), or light and desaturated (pastel tones).\n\nScoring examples:\n– 0: The image is entirely black and white; no color is present.\n– 50: Colors are visible but moderate, neither dull nor vivid.\n– 100: Colors are intense, bold, and maximally saturated, with a very strong visual impact."
    },
    {
        "Parameter": "Contrast",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the magnitude of the brightness differences between the darkest and lightest parts of the image. High contrast produces a very sharp image, with deep blacks and bright whites, while low contrast produces a soft, muted, or slightly hazy visual appearance. The score should reflect the overall intensity of perceived contrast, without regard to color saturation or sharpness.\n\nScoring examples:\n– 0: The image is very flat, with no harsh shadows or sharp highlights; everything appears uniform.\n– 50: There is a noticeable difference between light and dark areas, neither strong nor weak—neutral visual balance.\n– 100: The extremes of light and dark are pushed to the limit, with strong visual tension and sharp edges."
    },
    {
        "Parameter": "Sharpness",
        "Evaluation": "Score",
        "New Prompt": "Acuity Visual Review Score Not sharp, too sharp Sharpness refers to the clarity and distinctness of details in an image. It determines how well edges and fine details are defined, affecting the overall perceived sharpness and focus of the photo. \"Sharpness refers to the clarity and distinctness of details in an image. It determines how well edges and fine details are defined, affecting the overall perceived sharpness and focus of the photo.\nValue from 0: Image details are not sharp;\nTo 100: Image details are too sharp (Clarity+)\nScore type: Continuous score between 0 and 100.\""
    },
    {
        "Parameter": "Light Source Viewer",
        "Evaluation": "List",
        "New Prompt": "This parameter identifies, from the viewer's perspective, whether the light illuminating the scene appears ambient (uncontrolled) or directed by the photographer (controlled).\n\n– Ambient light refers to diffuse or natural lighting, such as daylight, indoor fluorescents, or street lighting, without obvious signs of direction or shaping.\n– Directed light refers to a source that is clearly controlled, focused, or directed (flash, spotlight, light sculpted onto the subject).\n– Both types can coexist if an ambient scene is complemented by point lighting.\n– The None category applies if no identifiable light source can be deduced from the image (e.g., flat rendering, abstraction, virtual light).\n\nPossible choices: \"Ambient\", \"Directed\", \"Ambient and Directed\", \"None\""
    },
    {
        "Parameter": "Color Temperature",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the perceived color temperature of the image, i.e., the visual cast ranging from blue (cool) to orange (warm). A cool temperature produces a bluish, neutral, or slightly greenish effect, evoking cool, morning, or artificial light. A warm temperature produces an orange, golden, or reddish effect, associated with evening light, warmth, or an intimate atmosphere. This score reflects the overall tone of the image, regardless of its saturation or brightness.\n\nScoring examples:\n– 0: The image has a marked blue or cyan cast, giving a cool or metallic feel.\n– 50: The colors are generally neutral, with no perceptible cool or warm cast.\n– 100: The image is very warm: orange, golden, and red hues, with an enveloping lighting ambiance."
    },
    {
        "Parameter": "Visual Harmony",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the level of visual harmony in the image, that is, how colors, shapes, and textures interact to create a sense of coherence and balance. High harmony results in a fluid, visually pleasing composition in which no element appears dissonant or arbitrary. This criterion does not depend on a particular style, but on the perceived relationship between the visual components that structure the image.\n\nScoring examples:\n– 0: The image is visually chaotic, with no clear connection between shapes, textures, or colors; a sense of disorder or incoherence.\n– 50: Some elements visually harmonize, while others appear less integrated; the image exudes partial harmony.\n– 100: The entire image forms a visually coherent whole, with clear complementarity between textures, shapes, and colors."
    },
    {
        "Parameter": "Overall Expert Assessment",
        "Evaluation": "Text",
        "New Prompt": "This parameter captures an expert photographer's overall assessment of the technical aspects of the image. The analysis may focus on exposure control, composition accuracy, sharpness, light quality, color rendering, or use of visual space. The commentary should reflect a synthetic professional assessment, without subjective judgment on the emotional or narrative content of the image.\n\nExamples of expected responses:\n– Good exposure control despite complex lighting conditions; the composition is stable and well-constructed.\n– Technically well-constructed image, but slightly overexposed in the highlights; sharpness is precise.\n– Sharpness issues in key areas, and slightly excessive contrast; the image remains well-framed overall."
    },
    {
        "Parameter": "Overall Technical Assessment",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures, on a scale of 0 to 100, the overall technical quality of the image as assessed by an expert. It summarizes all the criteria of photographic mastery: exposure, sharpness, white balance, light management, digital noise, distortion, optical aberrations, etc. This score does not take into account emotional or aesthetic impact, but only the perceived rigor of technical execution.\n\nScoring examples:\n– 0: The image has serious technical flaws: blurry, poorly exposed, noisy, distorted, or unexploited.\n– 50: The image is technically correct, but contains notable imperfections or uncontrolled settings.\n– 100: The image is technically flawless: perfect exposure, controlled sharpness, precise rendering, no visible anomalies."
    },
    {
        "Parameter": "Development",
        "Evaluation": "Boolean",
        "New Prompt": "This parameter detects whether the image has been developed, meaning whether it has undergone post-shooting adjustments to improve or correct its appearance. This can include operations such as cropping, adjusting exposure, contrast, white balance, saturation, or optimizing certain details. This criterion does not cover advanced retouching or editing, but only processing associated with a photographic development process, whether digital or analog.\n\nExample cases:\n– True: The image has been corrected for lighting, color, or composition after shooting.\n– False: The image appears raw from the sensor or film, with no visible or perceptible changes."
    },
    {
        "Parameter": "Image Realism",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures how realistic the image appears—that is, whether it could be perceived as a real scene captured by a camera, without any obvious visual inconsistencies. Realism is assessed through the consistency of light, textures, volumes, colors, proportions, and the overall environment. A highly realistic image will appear indistinguishable from a real photograph; an unrealistic image will feature visual anomalies, digital effects, or elements incompatible with the real world.\n\nScoring examples:\n– 0: The image is clearly unrealistic: abnormal proportions, inconsistent lighting, artificial textures, impossible elements.\n– 50: The image has a generally believable structure, but certain details (textures, hands, perspective, etc.) disrupt its plausibility.\n– 100: The image is entirely consistent with a real scene: natural light, believable volumes, realistic textures, no detectable anomalies."
    },
    {
        "Parameter": "AI Creation Probabiltiy",
        "Evaluation": "Score",
        "New Prompt": "This parameter measures the likelihood that an image was generated by artificial intelligence, based on its visual appearance. The analysis is based on the identification of common characteristics in synthetic images: anatomical inconsistencies, artificial textures, unrealistic lighting, blurred or generated backgrounds, abnormal repetitions, or excessive digital sharpening. The score reflects a visual estimation, without technical certainty, and should not take into account file metadata.\n\nScoring examples:\n– 0: The image exhibits all the hallmarks of a real photo: natural proportions, consistent details, credible imperfections.\n– 50: Some elements appear credible, but blurred areas, inconsistent textures, or structural errors raise doubts.\n– 100: The image is obviously synthetic: morphological or geometric inconsistencies, unrealistic textures, overly smooth or artificial rendering."
    },
    {
        "Parameter": "Photographic Intent",
        "Evaluation": "Text",
        "New Prompt": "This parameter describes the photographer's intention through the image, that is, the message, idea, or emotion they seem to want to express. The analysis may focus on the choice of subject, the style of treatment, the atmosphere created, or the narrative elements present in the scene. The goal is to interpret what the image seeks to convey beyond its technical or aesthetic qualities.\n\nExamples of expected answers:\n– Suggest urban solitude through the distant framing and isolation of the subject.\n– Create a sense of calm through the use of cool colors and symmetry.\n– Show the fragility of childhood through a gaze captured against the light.\n– Celebrate the momentum of a body in motion in a raw and graphic setting."
    },
    {
        "Parameter": "Emotional Impact",
        "Evaluation": "Text",
        "New Prompt": "## 🧠 Prompt AI — Free Emotional Reading (v1)\n\n### 🎭 ROLE\nYou are a **visual critic specializing in emotional perception**, tasked with writing down the **overall feeling a photograph can evoke**. You must neither rate the image nor structure your response with numerical data. Your analysis must be **fluent, sensitive, and natural**, like an oral observation or a gallery caption.\n\n---\n\n### 🎯 OBJECTIVE\n\nDescribe, in a single text:\n- **The emotions the image is likely to trigger** in an average observer.\n- **The general atmosphere** emanating from the image (light, colors, gestures, ambiance).\n- **The dominant visual feeling** (serenity, tension, tenderness, mystery, warmth, etc.).\n\nUse **subtle, evocative, poetic if necessary** vocabulary, but remain clear and anchored in the visual.\n\n---\n\n### 🔗 STYLE GUIDELINES\n- A single textual response, without hyphens, bullet points, scores, or tables.\n- No technical evaluation.\n- Maintain a **sensitive and accessible** writing style, somewhere between art criticism and personal observation.\n\n---\n\n### 🧾 EXAMPLE OUTPUT\n> The image exudes a feeling of softness and immediate proximity. The eye is drawn to the relaxed expressions, the natural light, and the simplicity of the moment. We sense a form of preserved, almost silent intimacy, like a moment suspended between two bursts of laughter or a still-invisible gesture of tenderness. Nothing is intended to impress; everything seems lived. A sincere and peaceful atmosphere emanates.\n\n---\n\nUse this format for each image you analyze. No JSON output is expected."
    },
    {
        "Parameter": "Intended Purpose",
        "Evaluation": "Text",
        "New Prompt": "This parameter describes the intended or likely use of the image, based on its style, intent, level of finish, and visual context. This can be artistic, personal, commercial, or editorial. The goal is to situate the photograph within its intended or interpreted context of use, whether public, private, or institutional.\n\nExamples of expected responses:\n– Advertising use for a lifestyle clothing brand campaign.\n– Illustration for a press article on dehumanized urban spaces.\n– Gallery display in a series of conceptual portraits.\n– Personal memento of a family or intimate moment."
    },
    {
        "Parameter": "Target Audience",
        "Evaluation": "Text",
        "New Prompt": "This parameter identifies the audience the image appears to be aimed at, based on its visual style, content, narrative intent, or likely distribution channel. The audience can be defined by age, culture, profession, interest, or aesthetic sensibility. This information can be interpreted or stated.\n\nExamples of expected responses:\n– Young adults who are fans of contemporary urban fashion.\n– Professionals in graphic design or visual advertising.\n– Families seeking to document authentic life moments.\n– Audiences interested in environmental or societal issues.\n– Viewers of a conceptual photography exhibition."
    },
    {
        "Parameter": "Detailed Emotional Impact",
        "Evaluation": "Text",
        "New Prompt": "## 🧠 Prompt AI — Emotional Impact Assessment (v1.2)\n\n### 🎭 ROLE\nYou are an **image critic specializing in emotional perception**, tasked with analyzing the **overall emotional impact of a photograph on different types of viewers**.\nYou rely on the **visual feel**, the atmosphere of the image, and the **photographer's intention, if specified**. You also adapt your analysis according to the **context of use** of the image.\n\n---\n\n### 🎯 OBJECTIVE\n\nYou must:\n1. Identify the **most commonly felt emotions** upon viewing the image.\n2. **Weight each of them** by an **estimated percentage** of probability.\n3. Provide an **overall emotional intensity score** (from 0 to 100). 4. Differentiate **according to 2 or 3 standard viewer types**.\n5. If an **explicit emotional intention** is provided, analyze the **match between the intention and the perceived effect**.\n6. Adapt emotional readings based on the **usage context** provided.\n\n---\n\n### 🧩 LIST OF PREDEFINED EMOTIONS\n\nUse a selection from this list (flexible):\n**Joy, Calm, Nostalgia, Pride, Sadness, Fascination, Excitement, Unease, Wonder, Serenity, Discomfort, Boredom**\n\n---\n\n### 🧬 TYPES OF VIEWERS (typical profile)\n\n- `general_public` (average viewer)\n- `feminine_gaze` (feminine artistic sensibility)\n- `masculine_gaze` (male sensibility)\n- `advertising_client` (potential marketing interpretation)\n\nYou can ignore one or more profiles if they don't seem relevant.\n\n---\n\n### 📝 INTENTION (optional)\n\nIf the photographer's **emotional intention** is provided (e.g., \"to convey childhood nostalgia\"), evaluate:\n- The **consistency** between the intention and the perceived emotions\n- The **success** of the rendering on a scale of 0 to 100\n- Add a **brief textual justification**\n\n---\n\n### 🧭 CONTEXT OF USE (optional)\n\nAdapts the emotional interpretation according to the provided context of use. Choose from:\n- `personal` (souvenir photo, diary, blog)\n- `advertising` (communication, product, lifestyle)\n- `exhibition` (gallery, contemporary art, installation)\n- `editorial` (press illustration or publication)\n\n---\n\n### 🧾 OUTPUT FORMAT\n\n```json\n{\n\"overall_emotional_impact\": 72,\n\"main_emotions\": {\n\"calm\": 60,\n\"nostalgia\": 50,\n\"pride\": 30\n},\n\"interpretation_according_to_profile\": {\n\"general_public\": {\n\"emotions\": { \"calm\": 60, \"nostalgia\": 50 },\n\"intensity\": 65,\n\"rating\": \"Image perceived as calming and evocative of memories.\"\n},\n\"feminine_gaze\": {\n\"emotions\": { \"warmth\": 55, \"sensuality\": 40 },\n\"intensity\": 70,\n\"score\": \"Soft perception of the curves and overall emotional warmth.\"\n},\n\"masculine_gaze\": {\n\"emotions\": { \"excitement\": 50, \"curiosity\": 40 },\n\"intensity\": 75,\n\"score\": \"More direct and stimulating reading of the shapes presented.\"\n}\n},\n\"fit_with_intention\": {\n\"declared_intention\": \"Evoke childhood nostalgia\",\n\"coherence\": true,\n\"success\": 85,\n\"justification\": \"The softness of the colors and the setting effectively evoke a warm and ancient memory.\"\n},\n\"context_analysis\": {\n\"personal\": {\n\"rating\": \"Ideal image to evoke an intimate memory, a moment suspended in a familiar place.\",\n\"intensity\": 70\n},\n\"advertising\": {\n\"rating\": \"Bright, warm, and natural atmosphere, suitable for promoting home decor, lifestyle, or slow living products.\",\n\"intensity\": 65\n},\n\"exhibition\": {\n\"rating\": \"Poetic reading of space and everyday life. Light and objects interact in a simple and nostalgic aesthetic.\",\n\"intensity\": 60\n}\n}\n}\n```"
    }
]